ec2-galera/percona-replicate.3/add_2_3120.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            939246
        write:                           335445
        other:                           134178
        total:                           1408869
    transactions:                        67089  (21.50 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 1274691 (408.54 per sec.)
    other operations:                    134178 (43.00 per sec.)

Test execution summary:
    total time:                          3120.0800s
    total number of events:              67089
    total time taken by event execution: 6239.4087
    per-request statistics:
         min:                                 17.59ms
         avg:                                 93.00ms
         max:                                835.59ms
         approx.  95 percentile:             230.67ms

Threads fairness:
    events (avg/stddev):           33544.5000/433.50
    execution time (avg/stddev):   3119.7044/0.03